jackeyjiang/STM32_DGUS/STM32_Demo/utilities/serialscreen/serialscreen.c
 /*******************************************************************************
 * 函数名称:MealCostDisp                                                                     
 * 描    述:显示当前餐品应付的金额                                                          
 *                                                                               
 * 输    入:                                                                 
 * 输    出:无                                                                     
 * 返    回:void                                                               
 * 修改日期:2014年3月13日                                                                    
 *******************************************************************************/ 
void MealCostDisp(char meal_id,char meal_count)
{
	  unsigned char temp[8]={0};
	  memcpy(temp,VariableWrite,sizeof(VariableWrite));
	  temp[2]= 5;
		temp[5]= (0x32+(meal_id-1)*3); //钱币变量地址
    temp[7]= GetMealPrice(meal_id,meal_count);	
		Uart3_Send(temp,sizeof(temp));		
}
 /*******************************************************************************
 * 函数名称:ClearUserBuffer                                                                     
 * 描    述:清除用户选择数据                                                          
 *                                                                               
 * 输    入:无                                                                 
 * 输    出:无                                                                     
 * 返    回:void                                                               
 * 修改日期:2014年3月13日                                                                    
 *******************************************************************************/ 
void ClearUserBuffer(void)
{
	UserAct.MealCnt_1st=0;
	UserAct.MealCnt_1st_t=0;
	UserAct.MealCnt_2nd=0;
	UserAct.MealCnt_2nd_t=0;
	UserAct.MealCnt_3rd=0;
	UserAct.MealCnt_3rd_t=0;
	UserAct.MealCnt_4th=0;
	UserAct.MealCnt_4th_t=0;
	UserAct.MealCost_1st=0;
	UserAct.MealCost_2nd=0;
	UserAct.MealCost_3rd=0;
	UserAct.MealCost_4th=0;
	UserAct.MealID=0;
}
 /*******************************************************************************
 * 函数名称:PutIntoShopCart                                                                     
 * 描    述:在选产界面将点击放入购物车之后的程序响应                                                        
 *                                                                               
 * 输    入:                                                                 
 * 输    出:无                                                                     
 * 返    回:void                                                               
 * 修改日期:2014年3月13日                                                                    
 *******************************************************************************/ 
void PutIntoShopCart(void)
{
	switch(UserAct.MealID)
	{
		case 0x01:
		{
			UserAct.MealCnt_1st= UserAct.MealCnt_1st_t;
			UserAct.MealCost_1st = GetMealPrice(UserAct.MealID,UserAct.MealCnt_1st);
		}break;
		case 0x02:
		{
			UserAct.MealCnt_2nd=UserAct.MealCnt_2nd_t;
			UserAct.MealCost_2nd = GetMealPrice(UserAct.MealID,UserAct.MealCnt_2nd);
		}break;
		case 0x03:
		{
			UserAct.MealCnt_3rd=UserAct.MealCnt_3rd_t;
			UserAct.MealCost_3rd = GetMealPrice(UserAct.MealID,UserAct.MealCnt_3rd);
		}break;
		case 0x04:
		{
			UserAct.MealCnt_4th=UserAct.MealCnt_4th_t;
			UserAct.MealCost_4th = GetMealPrice(UserAct.MealID,UserAct.MealCnt_4th);
		}break;
		default:break;	
	}
	PageChange((UserAct.MealID-1)*3+6); //不知道这个是否出问题???
}	

 /*******************************************************************************
 * 函数名称:SettleAccounts                                                                 
 * 描    述:当按下结算按钮后的程序流程                                                                                                                        
 * 输    入:无                                                                 
 * 输    出:无                                                                     
 * 返    回:void                                                               
 * 修改日期:2014年3月13日                                                                   
 *******************************************************************************/ 
char Floor= 0; //作为有商品种类的层数
void SettleAccounts(void)
{
	uint8_t tempcnt=0;
	//清除屏幕显示数据
  for(tempcnt=0;tempcnt<4;tempcnt++)
	{
		MealNameDisp(Null,tempcnt);
		MealCntDisp(Null,tempcnt);//显示数量
		MealCostDisplay(Null,tempcnt);//显示单总价 有两个重复		
	}
	tempcnt=0; /*计数清零*/
  PageChange(Acount_interface);//结算界面
	//在这里做标记 current = payformoney
  //显示硬币数
	VariableChage(payment_coin,UserAct.PayForCoins);
  //显示纸币数
	VariableChage(payment_bill,UserAct.PayForBills);
  //刷卡数
	VariableChage(payment_card,UserAct.PayForCards);
  //显示等待时间
	VariableChage(wait_payfor,60);
	//程序显示部分
	Floor= 0; //每次进一次结账界面就需要从新写入数据
	
	if(UserAct.MealCnt_1st>0)
	{
		DispMeal[Floor].meal_id= 0x01; //0x01为第一个餐品的ID
		DispMeal[Floor].meal_cnt= UserAct.MealCnt_1st; //餐品的数量赋值
		DispMeal[Floor].meal_cost= UserAct.MealCost_1st; //餐品单总价的赋值
		Floor++;
	}
	if(UserAct.MealCnt_2nd>0)
	{
		DispMeal[Floor].meal_id= 0x02; //0x02为第二个餐品的ID
		DispMeal[Floor].meal_cnt= UserAct.MealCnt_2nd; //餐品的数量赋值
		DispMeal[Floor].meal_cost= UserAct.MealCost_2nd; //餐品单总价的赋值
		Floor++;
	}		
  if(UserAct.MealCnt_3rd>0)
	{
		DispMeal[Floor].meal_id= 0x03; //0x03为第三个餐品的ID
		DispMeal[Floor].meal_cnt= UserAct.MealCnt_3rd; //餐品的数量赋值
		DispMeal[Floor].meal_cost= UserAct.MealCost_3rd; //餐品单总价的赋值
		Floor++;		
	}		
	if(UserAct.MealCnt_4th>0)
	{
		DispMeal[Floor].meal_id= 0x04; //0x01为第四个餐品的ID
		DispMeal[Floor].meal_cnt= UserAct.MealCnt_4th; //餐品的数量赋值
		DispMeal[Floor].meal_cost= UserAct.MealCost_4th; //餐品单总价的赋值
		Floor++;	
	}
	//加入显示的部分：从第一栏开始到第四栏
	for(tempcnt=0;tempcnt<Floor;tempcnt++)
	{
		MealNameDisp(DispMeal[tempcnt].meal_id,tempcnt);//显示菜名  
		MealCntDisp(DispMeal[tempcnt].meal_cnt,tempcnt);//显示数量
		MealCostDisplay(DispMeal[tempcnt].meal_cost,tempcnt);//显示单总价 有两个重复
	}
	UserAct.PayShould= (UserAct.MealCost_1st+UserAct.MealCost_2nd+UserAct.MealCost_3rd+UserAct.MealCost_4th);
	VariableChage(mealtotoal_cost,UserAct.PayShould);
}

