jackeyjiang/STM32_DGUS/STM32_Demo/utilities/serialscreen/serialscreen.c
      case mealcnt_choose:/*单页选择按钮*/
      {
			  switch(VariableData[1])
				{
					case 0x01:  /*放入购物车*/
					{
						PutIntoShopCart();		
					}break;
					case 0x02:  /*继续选餐*/
					{
						PageChange(Menu_interface);
					}break;
 					case 0x03:  /*结算*/
					{
						SettleAccounts();
					}break;
					case 0x04:  /*取消*/
					{
						//清空所有的用户数据???
						ClearUserBuffer();
						PageChange(Menu_interface);
					}break;
					default:break;
				}
			}break;
			/*改变四栏中餐品的数量*/
			/*需要餐品的ID和行号:column1st_count, MealID*/
			case column1st_count:MealID= DispMeal[0].meal_id;goto loop1;
			case column2nd_count:MealID= DispMeal[1].meal_id;goto loop1;
			case column3rd_count:MealID= DispMeal[2].meal_id;goto loop1;
			case column4th_count:MealID= DispMeal[3].meal_id;goto loop1;
			{
loop1:	switch(MealID)
				{
					case 0x01:
					{
					  if(VariableData[1]<=DefineMeal[MealID-1].MealCount)//当用户选择数量小于或等于存货时
				    {
					    UserAct.MealCnt_1st =VariableData[1]; //将改变的值返回到结构体中
					    UserAct.MealCost_1st =UserAct.MealCnt_1st *price_1st; //计算单总价
					    VariableChage(VariableAdress,UserAct.MealCnt_1st); //改变数量
					    VariableChage(VariableAdress+1,UserAct.MealCost_1st); //改变单总价，地址偏移1
				    }
				    else
				    {	
							VariableChage(VariableAdress,UserAct.MealCnt_1st); //维持原来所选的数量
				    }					
					}break;
					case 0x02:
					{
					  if(VariableData[1]<=DefineMeal[MealID-1].MealCount)//还是要判断数量
				    {
					    UserAct.MealCnt_2nd =VariableData[1]; //将改变的值返回到结构体中
					    UserAct.MealCost_2nd =UserAct.MealCnt_2nd *price_2nd; //计算单总价
					    VariableChage(VariableAdress,UserAct.MealCnt_2nd); //改变数量
					    VariableChage(VariableAdress+1,UserAct.MealCost_2nd); //改变单总价
				    }
				   else
				    {
					    VariableChage(VariableAdress,UserAct.MealCnt_2nd); //维持原来所选的数量
				    }									
					}break;
					case 0x03:
					{
					  if(VariableData[1]<=DefineMeal[MealID-1].MealCount)//还是要判断数量
				    {
					    UserAct.MealCnt_3rd =VariableData[1]; //将改变的值返回到结构体中
					    UserAct.MealCost_3rd =UserAct.MealCnt_3rd *price_3rd; //计算单总价
					    VariableChage(VariableAdress,UserAct.MealCnt_3rd); //改变数量
					    VariableChage(VariableAdress+1,UserAct.MealCost_3rd); //改变单总价
				    }
				   else
				    {
					     VariableChage(VariableAdress,UserAct.MealCnt_3rd); //维持原来所选的数量
				    }							
					}break;
					case 0x04:
					{
					  if(VariableData[1]<=DefineMeal[MealID-1].MealCount)//还是要判断数量
				    {
					    UserAct.MealCnt_4th =VariableData[1]; //将改变的值返回到结构体中
					    UserAct.MealCost_4th =UserAct.MealCnt_4th *price_4th; //计算单总价
					    VariableChage(VariableAdress,UserAct.MealCnt_4th); //改变数量
					    VariableChage(VariableAdress+1,UserAct.MealCost_4th); //改变单总价
				    }
				   else
				    {
					     VariableChage(VariableAdress,UserAct.MealCnt_4th); //维持原来所选的数量
				    }							
					}break;
					default:break;						
				}
				UserAct.PayShould= (UserAct.MealCost_1st+UserAct.MealCost_2nd+UserAct.MealCost_3rd+UserAct.MealCost_4th);
	      VariableChage(mealtotoal_cost,UserAct.PayShould);
			}break;
			case payment_method: /*付款方式*/
			{
				switch(VariableData[1])
				{
					case 0x01:   /*现金支付*/
					{
						//OpenCashSystem();
					}break;
					case 0x02:   /*银行预付卡*/
					{
						//CloseCashSystem();
					}break;
					case 0x03:   /*深圳通支付*/
					{
						//CloseCashSystem();
					}break;
					case 0x04:   /*取消*/
					{
						//CloseCashSystem();
						ClearUserBuffer();
						PageChange(Menu_interface);
					}break;
					default:break;		
				}					
			}break;
			case bill_print:
			{
				switch(VariableData[1])
				{
					case 0x01:   /*打印小票*/
					case 0x02:   /*不打印小票*/
					default:break;
				}
			}break;
			case password:
			{
				switch(VariableData[1])
				{
					case 0x00:
					case 0x01:
					case 0x02:
					case 0x03:
					case 0x04:
					case 0x05:
					case 0x06:
					case 0x07:
					case 0x08:
					case 0x09:
					case 0x0A:						
					case 0x0B:
					case 0x0C:
					case 0x0D:
					case 0x0E:
					case 0x0F:
					{
	          if(PassWordLen < 6)
		        {
		          InputPassWord[PassWordLen] = (VariableData[1]);
		          PassWordLen++;
			        DisplayPassWord(PassWordLen);//显示一个字符串******
		        }
	        }break;					
					case 0x10:/*退格键*/
					{
	          if(PassWordLen > 0)
		        {
	            InputPassWord[PassWordLen] = 0;
	            PassWordLen--;
		          DisplayPassWord(PassWordLen);
		        }
					}break;
					case 0x11:/*确认件*/
					{
	          GetPassWord(PassWord);
    	      if(VerifyPassword(PassWord, InputPassWord,6) == 0)
		        {
		          /*密码验证错误，进入密码输入界面*/
		           PageChange(Password_interface);
							 DisplayPassWord(0);
							 VariableChage(row_1st,Null);
		           VariableChage(row_2nd,Null);
		           VariableChage(row_3rd,Null);   							
			         PassWordLen = 0;
		        }
		        else
		        {
		           /*进入 管理员界面*/
		           PageChange(MealSet_interface);
							 DisplayPassWord(0);//清楚密码显示
							 InitSetting();//清空第一二三列的数据 //对放餐的数据进行初始化
			         PassWordLen = 0;
		        }
	        }break;						
					case 0x12:/*返回*/
					{
		        PageChange(Menu_interface);
						DisplayPassWord(0);//清楚密码显示
		        PassWordLen = 0;	
					}break;
          default:break;					
        } 					
			}break;
			case admin_set:
			{
				switch(VariableData[1])
				{
					case 0x01:  /*温度设置按钮*/
					{
						PageChange(TemperatureSet_interface);
					}break;
					case 0x02:  /*餐品设置按钮*/
					{
						PageChange(MealInput_interface);
					}break;
					case 0x03:	/*取消键*/
					{
						PageChange(Menu_interface);
					}
          default:break;
				}					
			}break;
			case meal_num:
			{
				//VariableData[1]; 需要对当前餐号进行记录,然后再处理
				InitSetting();
			  CurFloor.MealID= VariableData[1];	
			}break;
      case floor_num:
			{
			  CurFloor.FloorNum= VariableData[1];
			}break;
      case row_1st:
      {
				CurFloor.FCount= VariableData[1];
			}break;	
      case row_2nd:
      {
				CurFloor.SCount= VariableData[1];
			}break;	
      case row_3rd:
      {
				CurFloor.TCount= VariableData[1];
			}break;	
      case mealinput_choose:
			{
				switch(VariableData[1])
				{
					case 0x01:  /*放满*/
					{
						CurFloor.FCount = 3;
		        CurFloor.SCount = 3;
		        CurFloor.TCount = 3; 
		        CurFloor.MealCount = 9;
					  VariableChage(row_1st,CurFloor.FCount);
		        VariableChage(row_2nd,CurFloor.SCount);
		        VariableChage(row_3rd,CurFloor.TCount);	
					}break;
					case 0x02:  /*清空*/
					{
						CurFloor.FCount = 0;
		        CurFloor.SCount = 0;
		        CurFloor.TCount = 0; 
		        CurFloor.MealCount = 0;
					  VariableChage(row_1st,CurFloor.FCount);
		        VariableChage(row_2nd,CurFloor.SCount);
		        VariableChage(row_3rd,CurFloor.TCount);							
					}break;
					case 0x03:  /*确认*/
					{
						/*计算总共的餐品数*/
						CurFloor.MealCount=  CurFloor.FCount + CurFloor.SCount + CurFloor.TCount;
						/*把当前第一列设置的参数保存起来*/
						FloorMealMessageWriteToFlash.FloorMeal[CurFloor.FloorNum - 1].FCount    = CurFloor.FCount;
						/*把当前第2列设置的参数保存起来*/
						FloorMealMessageWriteToFlash.FloorMeal[CurFloor.FloorNum - 1].SCount    = CurFloor.SCount;
						/*把当前第3列设置的参数保存起来*/
						FloorMealMessageWriteToFlash.FloorMeal[CurFloor.FloorNum - 1].TCount    = CurFloor.TCount;
						/*把当前设置餐的ID号保存起来*/
						FloorMealMessageWriteToFlash.FloorMeal[CurFloor.FloorNum - 1].MealID    = CurFloor.MealID;
						/*把当前设置的餐的总数保存起来*/
						FloorMealMessageWriteToFlash.FloorMeal[CurFloor.FloorNum - 1].MealCount = CurFloor.MealCount;
						/*把设置餐的层数保存起来*/
						FloorMealMessageWriteToFlash.FloorMeal[CurFloor.FloorNum - 1].FloorNum  = CurFloor.FloorNum;
						/*九种菜品*/
						for(j = 0; j < 4; j++)	 //4代表餐ID号
						{
							/*各个餐的数目清零*/
							DefineMeal[j].MealCount = 0;
							/*各个餐的列对应的数目清零*/
							for(i = 0; i < FloorMealNum; i++)
							{
								DefineMeal[j].Position[i][0] = 0;
								DefineMeal[j].Position[i][1] = 0;
								DefineMeal[j].Position[i][2] = 0;
							}
							 /*统计各个餐的数目的总和*/
							for(i = 0; i < FloorMealNum; i++)
							{														 /*餐的ID是从1-4*/
								if(FloorMealMessageWriteToFlash.FloorMeal[i].MealID == j + 1)
								{
									DefineMeal[j].MealCount      = DefineMeal[j].MealCount + FloorMealMessageWriteToFlash.FloorMeal[i].MealCount;
									DefineMeal[j].Position[i][0] = FloorMealMessageWriteToFlash.FloorMeal[i].FCount;
									DefineMeal[j].Position[i][1] = FloorMealMessageWriteToFlash.FloorMeal[i].SCount;
									DefineMeal[j].Position[i][2] = FloorMealMessageWriteToFlash.FloorMeal[i].TCount;
									//printf("DefineMeal[%d].Position[%d][0]=%d\r\n",j,i,DefineMeal[j].Position[i][0]);
								}
							}
						}
						StatisticsTotal(); //先统计数目在写入
						WriteMeal(); //写数据到flash
						DispLeftMeal(); //更新餐品数据
						//printf("DefineMeal[%d].MealCount=%d\r\n",i,DefineMeal[i].MealCount);
					}break;
					case 0x04:  /*取消*/
					{
						CurFloor.FCount    = 0;
						CurFloor.SCount    = 0;
						CurFloor.TCount    = 0;
						CurFloor.MealID    = 0;
						CurFloor.MealCount = 0;
						CurFloor.FloorNum  = 0;	
						PageChange(Menu_interface);
						DispLeftMeal();//改变剩余餐品数量显示
					}break;
					case 0x05:  /*返回*/
					{
						CurFloor.FCount    = 0;
						CurFloor.SCount    = 0;
						CurFloor.TCount    = 0;
						CurFloor.MealID    = 0;
						CurFloor.MealCount = 0;
						CurFloor.FloorNum  = 0;	 
	          PageChange(MealSet_interface);
					}break;
					default:break;	
				}
			}break;
			case temprature_set:
			{
			//VariableData[1]; 温度变量=VariableData[1];
			}break;
			  default:break;		
		}
}
 /*******************************************************************************
 * 函数名称:DealSeriAceptData                                                                   
 * 描    述:处理从迪文屏幕返回的数据                                                        
 *          如何实现三个连续的数据：0xA5 0XA5 0X5A                                                                           
 * 输    入:无                                                                   
 * 输    出:无                                                                     
 * 返    回:void                                                               
 * 修改日期:2014年3月13日                                                                   
 *******************************************************************************/ 	
void DealSeriAceptData(void)
{
	unsigned char i;
	unsigned char temp,temp1,length,checkout;
	char RegisterAdress=0;
	int16_t VariableAdress=0;
	unsigned char Rx3DataBuff[10]={0};/*设置一个数组大小，?以免越界(out of bounds),?可变长度数组*/
	char RegisterData[5]={0};  //寄存器数据数组
	char VariableData[5]={0};  //变量数据数组
	char VariableLength= 0;   //变量数据的长度
	while(UART3_GetCharsInRxBuf()>7) //获取缓冲区大小，直至缓冲区无数据
	{	
		if(USART3_GetChar(&temp)==1)
		{	
			if(temp==FH0)	//匹配帧头第一个字节
			{ 
loop:	  if(USART3_GetChar(&temp1)==1)  
				{
					if(temp1==FH1)  //匹配帧头第二个字节：
					{
						if(USART3_GetChar(&length)==1)  //获取命令字节长度
						{
							checkout =1;//置位开始读取命令与数据标志	
						}	
					}
					else if(temp1==FH0)	goto loop; //如果持续出现0xA5则继续判断下一个字节是否为0x5A
				}
			}
			
		}
	 if(checkout==1) //直到获取数据长度，然后读缓存
	 {
	 	checkout =0;  //复位标志
		for(i=0;i<length;i++) USART3_GetChar(Rx3DataBuff+i);
		if(Rx3DataBuff[0]==0x81)  //读寄存器返回命令
		{
			RegisterAdress =Rx3DataBuff[1];
			for(i=0;i<(length-2);i++)
			RegisterData[i]=Rx3DataBuff[2+i];
			//加入修改相关数据的功能
		}
		else if(Rx3DataBuff[0]==0x83) //读数据存储器返回命令
		{
			myunion.adr[1] =Rx3DataBuff[1]; //有可能是小端模式引起的
			myunion.adr[0] =Rx3DataBuff[2];
			VariableAdress =myunion.adress;
			VariableLength =Rx3DataBuff[3];
			for(i=0;i<(length-4);i++)
			VariableData[i]=Rx3DataBuff[4+i];
			//加入修改变量地址数据的功能
			ChangeVariableValues(VariableAdress,VariableData,VariableLength);
		}
	}
	}		
}

